#+BEGIN_COMMENT
.. title: Recovering From the Ubuntu 18.10 Upgrade
.. slug: recovering-from-the-ubuntu-1810-upgrade
.. date: 2018-10-27 10:40:09 UTC-07:00
.. tags: ubuntu,nvidia,upgrade,repair
.. category: Ubuntu
.. link: 
.. description: Recovering from the unbootable Ubuntu 18.10 problem.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 1
* Anything Else?
  
#+BEGIN_SRC bash
lspci | grep VGA
#+END_SRC

#+RESULTS:
: 01:00.0 VGA compatible controller: NVIDIA Corporation GM206 [GeForce GTX 950] (rev a1)

This card actually tended to freeze when I used the open source video drivers that come with Ubuntu so not having the Nvidia drivers seemed like a bad idea. I'm hoping that re-installing them will fix whatever bad setup values were there so I did:

#+BEGIN_EXAMPLE
sudo ubuntu-drivers autoinstall
#+END_EXAMPLE

Cross your fingers.
